// Задача2 Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.Write("Введите первое число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int B = Convert.ToInt32(Console.ReadLine());

// if(A>B)
// {
//     Console.Write($"Max={A} Min={B}");
// }
// if(A == B)
// {
//     Console.Write($"{A} = {B}");
// }
// if (A<B)
// {
//     Console.Write($"Max={B} Min={A}");
// }